[
  {
    "title": "Digital marketing",
    "shortDescription": "In the dynamic and ever-evolving field of digital marketing, professionals need a diverse skill set to succeed in driving effective strategies, engaging audiences, and achieving business objectives. Here's an elaborate overview of the key skills required for various digital marketing roles:\n\n\n",
    "description": "<h3>Email Marketing</h3>\n<p>Proficiency in email marketing involves crafting compelling email campaigns, managing subscriber lists, segmenting audiences, and analyzing performance metrics to optimize engagement and conversion rates.</p>\n<h3>Social Media Marketing</h3>\n<p>Social media marketing skills encompass creating engaging content, managing social media accounts, building brand presence, running paid advertising campaigns, and analyzing metrics to drive audience growth and engagement across platforms.</p>",
    "deadLine": "2025-07-25",
    "country": "india",
    "id": "mdihyjpzdmkz6o0auoe"
  },
  {
    "title": "Python + AI Developer",
    "shortDescription": "Develop, maintain, and optimize Python-based applications that power our AI solutions.",
    "description": "<p>[10:01 PM, 7/20/2025] 🎼Sai🎼: Key Responsibilities:<br>Develop, maintain, and optimize Python-based applications that power our AI solutions.<br>Build RESTful APIs and microservices to serve AI models<br>Write clean, maintainable, and efficient code.<br>Troubleshoot, debug, and optimize applications.<br>Collaborate with cross-functional teams to define, design, and ship new features.<br>Work closely with product owner and team members to decompose stories, design features, and prioritize tasks.<br>Prototype, validate and create specific application solutions for the business.<br>Excellent written and verbal communication skills, including experience speaking to technical and business audiences.<br>&nbsp;<br>Required Skills:<br>6+ years of professional experience in Python software development.<br>Strong understanding of object-oriented programming and design patterns.<br>Solid understanding of AI . Must have project experience.<br>Experience with SQL/NoSQL.<br>Experience with cloud platforms such as Azure is advantage.<br>Knowledge of unit testing<br>Familiarity with Git or other version control systems.<br>Ability to work in an Agile/Scrum environment.<br>&nbsp;<br>Work Timings :<br>Predominantly India Day Shift. On a need basis must connect and work with US client and join client calls/ meetings with US team (US work hours).<br>&nbsp;<br>Location<br>India Remote<br>[10:01 PM, 7/20/2025] 🎼Sai🎼: India Vi raa<br>[10:02 PM, 7/20/2025] 🎼Sai🎼: Urgent Req</p>\n<p>Title: Java Tech Lead with J2ee<br>Location - Alpharetta / Menlo Park, CA<br>Client CTS/ Morgan Stanley</p>\n<p><br>RESPONSIBILITIES<br>* Lead a technical team to design and implement highly reliable, scale-able, extensible, maintainable, global, and operable products and platforms<br>Draft and review architectural diagrams, interface specifications, class structures, and other design documents<br>Build systems that balance resources, constraints, requirements, and complexity<br>Present opportunities with cost/benefit analysis to leadership in order to shape decisions regarding architectural strategy<br>Evangelize technologies, solutions, and best practices developed with the organization<br>Develop department-wide technical perspectives, standards, solutions, and strategies that resolve significant product or organizational pain-points<br>Participate in a network of principal engineers to share ideas, practices, and experiences<br>Work closely with product management and development teams<br>You must enjoy challenging engineering problems. We are looking for someone who can solve complex issues<br>We value principal engineers who do enough hands-on implementation work to keep current with technology trends inside and outside the company<br>Lead and mentor other back-end engineers</p>\n<p>Basic<br>Minimum of 8 years of software development experience<br>Bachelor degree in Computer Science or a related field<br>Strong Proficiency with either Go or Java/J2EE<br>Preferred<br>Expert in software development domain and principles, including design patterns, data structures, continuous integration and deployment architecture<br>Solid experience in working with either Golang or Java. Knowledge in multiple languages like GO,<br>Java, C++ will be a plus.<br>Knowledge on Spring, Spring Boot, JPA/Hibernate and C/C++, batch scripts - perl or ksh.<br>Good understanding of Web Services protocols such as REST, SOAP, gRPC and API design for extensibility and portability<br>Experience writing SQL queries for Sybase or another Relational Database is required.<br>Well versed with OOD and SOA principles.<br>Experience of working in UNIX environment. Knowledge of UNIX based shell scripts is required<br>Working knowledge of cloud, service mesh and containers<br>Team player possessing strong analytical, problem solving and communication skills<br>Experience with SCRUM, Agile and iterative approaches a plus<br>Creative thinker, self-starter, able to work on multiple projects simultaneously</p>",
    "deadLine": "2025-08-08",
    "country": "india",
    "id": "mdcuxn457m0e62fawne"
  },
  {
    "title": " Java Tech Lead with J2ee",
    "shortDescription": "﻿﻿Develop department-wide technical perspectives, standards, solutions, and strategies that resolve significant product or organizational pain-points\n﻿﻿Participate in a network of principal engineers to share ideas, practices, and experiences",
    "description": "<p>Title: Java Tech Lead with J2ee<br>Location - Alpharetta / Menlo Park, CA<br>Client CTS/ Morgan Stanley</p>\n<p><br>RESPONSIBILITIES<br>&bull; Lead a technical team to design and implement highly reliable, scale-able, extensible, maintainable, global, and operable products and platforms<br>Draft and review architectural diagrams, interface specifications, class structures, and other design documents<br>Build systems that balance resources, constraints, requirements, and complexity<br>Present opportunities with cost/benefit analysis to leadership in order to shape decisions regarding architectural strategy<br>Evangelize technologies, solutions, and best practices developed with the organization<br>Develop department-wide technical perspectives, standards, solutions, and strategies that resolve significant product or organizational pain-points<br>Participate in a network of principal engineers to share ideas, practices, and experiences<br>Work closely with product management and development teams<br>You must enjoy challenging engineering problems. We are looking for someone who can solve complex issues<br>We value principal engineers who do enough hands-on implementation work to keep current with technology trends inside and outside the company<br>Lead and mentor other back-end engineers</p>\n<p>Basic<br>Minimum of 8 years of software development experience<br>Bachelor degree in Computer Science or a related field<br>Strong Proficiency with either Go or Java/J2EE<br>Preferred<br>Expert in software development domain and principles, including design patterns, data structures, continuous integration and deployment architecture<br>Solid experience in working with either Golang or Java. Knowledge in multiple languages like GO,<br>Java, C++ will be a plus.<br>Knowledge on Spring, Spring Boot, JPA/Hibernate and C/C++, batch scripts - perl or ksh.<br>Good understanding of Web Services protocols such as REST, SOAP, gRPC and API design for extensibility and portability<br>Experience writing SQL queries for Sybase or another Relational Database is required.<br>Well versed with OOD and SOA principles.<br>Experience of working in UNIX environment. Knowledge of UNIX based shell scripts is required<br>Working knowledge of cloud, service mesh and containers<br>Team player possessing strong analytical, problem solving and communication skills<br>Experience with SCRUM, Agile and iterative approaches a plus<br>Creative thinker, self-starter, able to work on multiple projects simultaneously</p>",
    "deadLine": "2025-07-30",
    "country": "us",
    "id": "mdctygeozzao2fhtx9t"
  }
]